package schedule

const (
	CountOfGroups4   = 5
	CountOfGroups3   = 15
	CountOfGroups2   = 11
	CountOfGroups111 = 11
	CountOfGroups19  = 18

	Course4s   = "4к 9кл, 3к 11кл"
	Course3s   = "3к 9кл, 2к 11кл"
	Course2s   = "2к 9кл, 1к 11 кл"
	Course111s = "1к 11кл"
	Course19s  = "1к 9кл"

	Course4i   = 4
	Course3i   = 3
	Course2i   = 2
	Course111i = 1
	Course19i  = 0
)

// ScheduleInfo - map variable with - map[string]map[string]int signature,
// returns integer of group, for work wit MSExcel.
//
//	example: var groupNumber int = ScheduleInfo[course][group]
var ScheduleInfo = map[string]map[string]int{
	"4к 9кл, 3к 11кл": {
		"ИСП/П-22-09":              3,
		"ИСП/П-23-11":              4,
		"ИСП/Р-22-09\nИСП/Р-23-11": 5,
		"РЕК-22-09\nРЕК-23-11":     6,
		"ДО-23-11":                 7,
	},
	"3к 9кл, 2к 11кл": {
		"БАД-24-11":                  3,
		"ТД-24-11":                   4,
		"ФИН-23-09\nФИН-24-11":       5,
		"КОМ-23-09":                  6,
		"ОДЛ-23-09\nОДЛ-24-11":       7,
		"ЮР/со-24-11":                8,
		"ПСО-23-09.1":                9,
		"ПСО-23-09.2":                10,
		"РЕК-24-11":                  11,
		"РЕК-23-09":                  11,
		"ДИЗ-24-11":                  12,
		"ИСП/р-23-09\nИСП/р-24-11":   13,
		"ИСП/п-23-09.1":              14,
		"ИСП/п-23-09.2\nИСП/п-24-11": 15,
		"ФК-24-11":                   16,
	},
	"2к 9кл, 1к 11 кл": {
		"БАД-24-09\nБАД-25-11":     3,
		"ФИН-24-09":                4,
		"БУХ-24-09":                5,
		"КСК-24-09\nКСК-25-11":     6,
		"ИСП/П-24-09":              7,
		"ИСП/Р-24-09":              8,
		"ТД-24-09":                 9,
		"ОДЛ-24-09":                10,
		"ЮР/со-24-09\nЮР/со-25-11": 11,
		"ЮР/са-24-09\nЮР/са-25-11": 12,
		"РЕК-24-09":                13,
	},
	"1к 11кл": {
		"ФИН-25-11":   3,
		"БУХ-25-11":   4,
		"ТД-25-11":    5,
		"ОДЛ-25-11":   6,
		"ОИБАС-25-11": 7,
		"ИСП/П-25-11": 8,
		"ИСП/Р-25-11": 9,
		"РЕК-25-11":   10,
		"ДИЗ-25-11":   11,
		"ФК-25-11":    12,
		"ПВНК-25-11":  13,
	},
	"1к 9кл": {
		"БАД-25-09":     3,
		"БУХ-25-09":     4,
		"ФИН-25-09":     5,
		"ИСП/П-25-09.1": 6,
		"ИСП/П-25-09.2": 7,
		"ИСП/Р-25-09":   8,
		"КСК-25-09":     9,
		"ТД-25-09.1":    10,
		"ТД-25-09.2":    11,
		"ОДЛ-25-09.1":   12,
		"ОДЛ-25-09.2":   13,
		"ЮР/са-25-09.1": 14,
		"ЮР/са-25-09.2": 15,
		"ЮР/со-25-09":   16,
		"РЕК-25-09.1":   17,
		"РЕК-25-09.2":   18,
		"РЕК-25-09.3":   19,
		"ПВНК-25-09":    20,
	},
}
